// Написать программу вычисления значения функции y = f(a)

double Function(double a)
{
    return (a*a);
}

System.Console.WriteLine(Function(6));

// void Pause(string message) // описание подпрограммы (метода)
// {
//     Sistem.Console.WriteLine(message);
//     Console.ReadKey;
// }
// Pause("Pres any key"); // вызов